# unordered_set 常用：count /erase
> `unordered_set<char> win;` 底层哈希表，存元素，**不允许重复**。

## 1. count()
```
win.count(x);
```

- 功能：**判断元素 x 是否存在集合中**
- 返回值：`1` 存在；`0` 不存在
> 不是返回下标，不是返回出现多少次！set 里面元素最多出现 1 次，所以只有 0 或 1。

示例
unordered_set<char> st;
st.insert('a');
st.insert('b');

cout << st.count('a'); //1，存在
cout << st.count('c'); //0，不存在
```

等价写法（不常用）
if(st.find(x) != st.end()) //找到，存在
```

做题一般简写：`if(st.count(x))`

————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

## 2. erase () 删除

erase 有**三种重载形式**，刷题最容易踩坑。

### ① erase (元素值) 滑动窗口用的
```
win.erase(s[left]);
```

传入**要删除的元素本身**，不是下标！
把集合里面这个值删掉。
如果元素根本不存在，**什么都不做，不会报错**。

```
unordered_set<char> st;
st.insert('a');
st.erase('a');  //删掉a
st.erase('z');  //z不存在，无事发生
```
高频错误
```
st.erase(left);   //错！left是int下标，不是字符
st.erase(s[left]);//对！取出下标对应的字符，删除这个字符
```

### ② erase (迭代器)
```
auto it = st.find('b');
if(it != st.end()){
    st.erase(it);
}
```

传迭代器，删除迭代器指向的元素。
> 如果给`end()`会直接崩溃，所以要先判断不等于 end。


### ③ erase (迭代器区间)
```
st.erase(st.begin(), st.end()); //清空整个集合
```
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
## 其他配套常用 API（刷题）
```
st.insert(x);   //插入元素，重复插入不会报错，集合不变
st.size();      //集合里面元素个数
st.clear();     //全部清空
st.empty();     //为空返回true
```



## 易混坑点总结

1. `count(x)`参数是**元素**，不是下标；返回只有 0 或 1。
2. `erase(x)`传**元素值**，不是下标！`erase(s[left])`，不要写`erase(left)`。
3. erase 一个不存在的元素不会抛错，安全。
4. set 容器存的是值，不像数组，**没有下标这个概念**！不能用`win[0]`访问。


————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
## 其他高频 API

```
mp['c'] = 3;         // 如果key不存在，直接插入；存在则覆盖原来的value
int x = mp['c'];     // 重点坑！如果key不存在，mp['c']会自动插入这个key，value默认0！

mp.at('c');          // 获取key对应value，key不存在直接抛异常，不会新增
mp.size();           //键值对总个数
mp.clear();          //清空
mp.empty();          //为空true
```

### 超级大坑：`mp[key]` 会自动插入！

```
unordered_map<char,int> mp;
if(mp['z'] == 0)   // 即使z不存在！执行这一句就把 ('z',0)插进map！
{

}
```
> 判断 key 是否存在，**不要用 `if(mp[key])`，要用 count /find**。
